app/controllers/api/v1/surveys_controller.rb

SELECT "surveys".* FROM "surveys"
---
  def index
    @surveys = Survey.all

INSERT INTO "surveys" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "sdv"], ["description", "sbv"], ["created_at", "2024-07-18 06:37:43.285016"], ["updated_at", "2024-07-18 06:37:43.285016"]]
---
  def create
        @survey = Survey.new(survey_params)
        if @survey.save

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
      @survey = Survey.find_by(id: params[:id])

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "surveys" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "surveys"."id" = ?  [["name", "Manish_9"], ["description", "testing data_9 by api"], ["updated_at", "2024-07-18 14:10:32.151917"], ["id", 9]]
---
    def update
      @survey = Survey.find_by(id: params[:id])
      if @survey
        if @survey.update(survey_params)